python/planning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-27 Sat 14:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Planning</title>
<meta name="author" content="Coach Jesse" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Planning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge56d8f3">1. References</a></li>
<li><a href="#orgf7c0e91">2. Introduction to Computer Programming with Python - II</a></li>
<li><a href="#org09dd60c">3. Intermediate Computer Programming I - Text processing and basic web programming using Python</a></li>
<li><a href="#org27c6ed6">4. Intermediate Computer Programming II - Advanced Python and introduction to parallel programming</a></li>
<li><a href="#org0b50817">5. Intermediate Computer Programming III - Introduction to web development with Python Flask</a></li>
<li><a href="#org8a43f33">6. Intermediate Computer Programming IV - Introduction to GUI application development with Qt for Python</a></li>
<li><a href="#orgdc3772a">7. Advanced Computer Programming I - Introduction to data structures and algorithms</a></li>
<li><a href="#org96fd168">8. Advanced Computer Programming II - Objected-oriented design</a></li>
<li><a href="#org5d21c1c">9. Advanced Computer Programming III - Database and data processing</a></li>
<li><a href="#org05ad68c">10. Advanced Computer Programming IV - Robot software development with ROS and Python</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge56d8f3" class="outline-2">
<h2 id="orge56d8f3"><span class="section-number-2">1</span> References</h2>
<div class="outline-text-2" id="text-1">
<p>
freecodecamp intermediate python <a href="https://youtu.be/HGOBQPFzWKo">https://youtu.be/HGOBQPFzWKo</a>
Python for kids book
UC Berkeley CS61A Spring 2012 <a href="https://inst.eecs.berkeley.edu//~cs61a/sp12/">https://inst.eecs.berkeley.edu//~cs61a/sp12/</a>
</p>
</div>
</div>


<div id="outline-container-orgf7c0e91" class="outline-2">
<h2 id="orgf7c0e91"><span class="section-number-2">2</span> Introduction to Computer Programming with Python - II</h2>
<div class="outline-text-2" id="text-2">
<p>
Course set up: Python runtime environment on repl.it
Basics of computer architecture: Numbers and data storage in memory. What is a program? How program is executed.
Built-in data types: list, tuple, string, dictionary, set. Their properties and advanced operations.
Built-in functions: definition and structure review, abs, int, bool, dir, input, len, max, min, sum, range, random numbers
Procedure programming: conditions, loops, continue and break, exceptions
Name scopes, file organization: modules and packages
Comprehension: list comprehension, dictionary comprehension
Special operations: unpacking, the asterisk operator: * and **
Functions and code reuse: DRY, higher-order function, lambda function, function arguments
Objected-oriented programming: Class, objects, data abstraction, inheritance, composition, references
</p>

<p>
Programming puzzles and mini projects:
</p>
<ul class="org-ul">
<li>Turtle drawing: rectangle, triangle, box without corners (octagon missing four sides), pitchfork</li>
<li>Giraffe shuffle</li>
<li>Tkinter and GUI programming</li>
<li>Bounce! game</li>
<li>Mr. Stick Man game</li>
</ul>
</div>
</div>

<div id="outline-container-org09dd60c" class="outline-2">
<h2 id="org09dd60c"><span class="section-number-2">3</span> Intermediate Computer Programming I - Text processing and basic web programming using Python</h2>
<div class="outline-text-2" id="text-3">
<p>
Data containers in Python standard library: namedtuple, Counter
Advanced string and file operations
Data serializing: text vs. binary data, pickle, JSON
Debugging,Testing and logging
Regular expression
Concept of networks and Internet client and server, and web service
Web scraping
</p>
</div>
</div>

<div id="outline-container-org27c6ed6" class="outline-2">
<h2 id="org27c6ed6"><span class="section-number-2">4</span> Intermediate Computer Programming II - Advanced Python and introduction to parallel programming</h2>
<div class="outline-text-2" id="text-4">
<p>
Dunder methods and operator overloading.
Advanced functions: function as an object, closure, property methods
Decorators: decorator function, decorator class
Shallow vs. deep copying
Context manager
Map-filter-reduce paradiam
Multithreading and multiprocessing
</p>
</div>
</div>

<div id="outline-container-org0b50817" class="outline-2">
<h2 id="org0b50817"><span class="section-number-2">5</span> Intermediate Computer Programming III - Introduction to web development with Python Flask</h2>
</div>

<div id="outline-container-org8a43f33" class="outline-2">
<h2 id="org8a43f33"><span class="section-number-2">6</span> Intermediate Computer Programming IV - Introduction to GUI application development with Qt for Python</h2>
</div>



<div id="outline-container-orgdc3772a" class="outline-2">
<h2 id="orgdc3772a"><span class="section-number-2">7</span> Advanced Computer Programming I - Introduction to data structures and algorithms</h2>
<div class="outline-text-2" id="text-7">
<p>
Recursion and iteration
Algorithm&rsquo;s efficiency and complexity
Advanced data structure: deque, defaultdict, heap
Data structure basics: complexity functions, arrays, queue, binary search tree
Iterators and generators: their concepts, definition and itertools
</p>
</div>
</div>

<div id="outline-container-org96fd168" class="outline-2">
<h2 id="org96fd168"><span class="section-number-2">8</span> Advanced Computer Programming II - Objected-oriented design</h2>
</div>


<div id="outline-container-org5d21c1c" class="outline-2">
<h2 id="org5d21c1c"><span class="section-number-2">9</span> Advanced Computer Programming III - Database and data processing</h2>
</div>

<div id="outline-container-org05ad68c" class="outline-2">
<h2 id="org05ad68c"><span class="section-number-2">10</span> Advanced Computer Programming IV - Robot software development with ROS and Python</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Coach Jesse</p>
<p class="date">Created: 2021-03-27 Sat 14:14</p>
</div>
</body>
</html>
